## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs"
        name                              = "findatppr353logs"
        tags                              = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ default_action             = "Allow" -> "Deny"
          ~ ip_rules                   = [
              + "40.122.243.248",
              + "52.190.17.206",
            ]
          ~ virtual_network_subnet_ids = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra",
            ]
            # (1 unchanged attribute hidden)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/sites/find-a-tp-pr-353"
              + endpoint_tenant_id   = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            }
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_key_vault.default will be destroyed
  # (because azurerm_key_vault.default is not in configuration)
  - resource "azurerm_key_vault" "default" {
      - access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = [
                  - "Create",
                  - "Get",
                ]
              - object_id               = "049a4264-d53c-47da-ba4b-d8f2dc8ff057"
              - secret_permissions      = [
                  - "Set",
                  - "Get",
                  - "Delete",
                  - "Purge",
                  - "Recover",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "33a83012-e004-4513-bfca-a78afc5ecd9a"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
        ] -> null
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = true -> null
      - enabled_for_template_deployment = false -> null
      - id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv" -> null
      - location                        = "westeurope" -> null
      - name                            = "find-a-tp-pr-353-kv" -> null
      - public_network_access_enabled   = true -> null
      - purge_protection_enabled        = true -> null
      - resource_group_name             = "s177d01-ntp-pr-353" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_retention_days      = 7 -> null
      - tags                            = {
          - "Environment"      = "pr-353"
          - "Product"          = "National Tutoring Programme"
          - "Service Offering" = "National Tutoring Programme"
        } -> null
      - tenant_id                       = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> null
      - vault_uri                       = "https://find-a-tp-pr-353-kv.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # azurerm_key_vault_secret.blobstorageclientsecret will be destroyed
  # (because azurerm_key_vault_secret.blobstorageclientsecret is not in configuration)
  - resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      - id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/BlobStorage--ClientSecret/c6126549e84441fcb630cdb6aca84f0e" -> null
      - key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv" -> null
      - name                    = "BlobStorage--ClientSecret" -> null
      - resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/BlobStorage--ClientSecret/versions/c6126549e84441fcb630cdb6aca84f0e" -> null
      - resource_versionless_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/BlobStorage--ClientSecret" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "c6126549e84441fcb630cdb6aca84f0e" -> null
      - versionless_id          = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/BlobStorage--ClientSecret" -> null
    }

  # azurerm_key_vault_secret.fatpdbconnectionstring will be destroyed
  # (because azurerm_key_vault_secret.fatpdbconnectionstring is not in configuration)
  - resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      - id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpDatabase/b0d54cb1b8bb43d6ad554ead00e45d98" -> null
      - key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv" -> null
      - name                    = "ConnectionStrings--FatpDatabase" -> null
      - resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/ConnectionStrings--FatpDatabase/versions/b0d54cb1b8bb43d6ad554ead00e45d98" -> null
      - resource_versionless_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/ConnectionStrings--FatpDatabase" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b0d54cb1b8bb43d6ad554ead00e45d98" -> null
      - versionless_id          = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpDatabase" -> null
    }

  # azurerm_key_vault_secret.fatpredisconnectionstring will be destroyed
  # (because azurerm_key_vault_secret.fatpredisconnectionstring is not in configuration)
  - resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
      - id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpRedis/2885b0066b10408db26ef31c05043932" -> null
      - key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv" -> null
      - name                    = "ConnectionStrings--FatpRedis" -> null
      - resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/ConnectionStrings--FatpRedis/versions/2885b0066b10408db26ef31c05043932" -> null
      - resource_versionless_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/ConnectionStrings--FatpRedis" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "2885b0066b10408db26ef31c05043932" -> null
      - versionless_id          = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/ConnectionStrings--FatpRedis" -> null
    }

  # azurerm_key_vault_secret.govuknotifyapikey will be destroyed
  # (because azurerm_key_vault_secret.govuknotifyapikey is not in configuration)
  - resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      - id                      = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/GovUkNotify--ApiKey/b9ea2b7b9dde47758b7e98128187ba7e" -> null
      - key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv" -> null
      - name                    = "GovUkNotify--ApiKey" -> null
      - resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/GovUkNotify--ApiKey/versions/b9ea2b7b9dde47758b7e98128187ba7e" -> null
      - resource_versionless_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-353-kv/secrets/GovUkNotify--ApiKey" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b9ea2b7b9dde47758b7e98128187ba7e" -> null
      - versionless_id          = "https://find-a-tp-pr-353-kv.vault.azure.net/secrets/GovUkNotify--ApiKey" -> null
    }

  # azurerm_postgresql_flexible_server.default will be destroyed
  # (because azurerm_postgresql_flexible_server.default is not in configuration)
  - resource "azurerm_postgresql_flexible_server" "default" {
      - administrator_login           = "fatpadmin" -> null
      - administrator_password        = (sensitive value) -> null
      - backup_retention_days         = 35 -> null
      - fqdn                          = "find-a-tp-pr-353-psqlflexible-server.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled  = false -> null
      - id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-353-psqlflexible-server" -> null
      - location                      = "westeurope" -> null
      - name                          = "find-a-tp-pr-353-psqlflexible-server" -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "s177d01-ntp-pr-353" -> null
      - sku_name                      = "B_Standard_B1ms" -> null
      - storage_mb                    = 32768 -> null
      - tags                          = {
          - "Environment"      = "pr-353"
          - "Product"          = "National Tutoring Programme"
          - "Service Offering" = "National Tutoring Programme"
        } -> null
      - version                       = "14" -> null
      - zone                          = "1" -> null

      - authentication {
          - active_directory_auth_enabled = false -> null
          - password_auth_enabled         = true -> null
        }
    }

  # azurerm_postgresql_flexible_server_configuration.default will be destroyed
  # (because azurerm_postgresql_flexible_server_configuration.default is not in configuration)
  - resource "azurerm_postgresql_flexible_server_configuration" "default" {
      - id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-353-psqlflexible-server/configurations/azure.extensions" -> null
      - name      = "azure.extensions" -> null
      - server_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-353-psqlflexible-server" -> null
      - value     = "CITEXT,UUID-OSSP" -> null
    }

  # azurerm_postgresql_flexible_server_database.default will be destroyed
  # (because azurerm_postgresql_flexible_server_database.default is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "default" {
      - charset   = "UTF8" -> null
      - collation = "en_US.utf8" -> null
      - id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-353-psqlflexible-server/databases/find-a-tp-pr-353-db" -> null
      - name      = "find-a-tp-pr-353-db" -> null
      - server_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-353-psqlflexible-server" -> null
    }

  # azurerm_postgresql_flexible_server_firewall_rule.default will be destroyed
  # (because azurerm_postgresql_flexible_server_firewall_rule.default is not in configuration)
  - resource "azurerm_postgresql_flexible_server_firewall_rule" "default" {
      - end_ip_address   = "13.80.73.157" -> null
      - id               = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-353-psqlflexible-server/firewallRules/azurerm-natgateway-public-static-ip-fw" -> null
      - name             = "azurerm-natgateway-public-static-ip-fw" -> null
      - server_id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-353-psqlflexible-server" -> null
      - start_ip_address = "13.80.73.157" -> null
    }

  # azurerm_redis_cache.default will be destroyed
  # (because azurerm_redis_cache.default is not in configuration)
  - resource "azurerm_redis_cache" "default" {
      - capacity                      = 0 -> null
      - enable_non_ssl_port           = false -> null
      - family                        = "C" -> null
      - hostname                      = "find-a-tp-pr-353-redis-cache.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cache/redis/find-a-tp-pr-353-redis-cache" -> null
      - location                      = "westeurope" -> null
      - minimum_tls_version           = "1.2" -> null
      - name                          = "find-a-tp-pr-353-redis-cache" -> null
      - port                          = 6379 -> null
      - primary_access_key            = (sensitive value) -> null
      - primary_connection_string     = (sensitive value) -> null
      - public_network_access_enabled = true -> null
      - redis_version                 = "6.0" -> null
      - replicas_per_master           = 0 -> null
      - replicas_per_primary          = 0 -> null
      - resource_group_name           = "s177d01-ntp-pr-353" -> null
      - secondary_access_key          = (sensitive value) -> null
      - secondary_connection_string   = (sensitive value) -> null
      - shard_count                   = 0 -> null
      - sku_name                      = "Basic" -> null
      - ssl_port                      = 6380 -> null
      - tags                          = {
          - "Environment"      = "pr-353"
          - "Product"          = "National Tutoring Programme"
          - "Service Offering" = "National Tutoring Programme"
        } -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null

      - patch_schedule {
          - day_of_week        = "Sunday" -> null
          - maintenance_window = "PT5H" -> null
          - start_hour_utc     = 23 -> null
        }

      - redis_configuration {
          - aof_backup_enabled              = false -> null
          - enable_authentication           = true -> null
          - maxclients                      = 256 -> null
          - maxfragmentationmemory_reserved = 30 -> null
          - maxmemory_delta                 = 30 -> null
          - maxmemory_policy                = "volatile-lru" -> null
          - maxmemory_reserved              = 30 -> null
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-353-pr-353applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-353-pr-353httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.dns_a_record_set.web_app_service_ip_address will be read during apply
  # (config refers to values not yet known)
 <= data "dns_a_record_set" "web_app_service_ip_address" {
      + addrs = (known after apply)
      + host  = (known after apply)
      + id    = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights.web_app_service must be replaced
-/+ resource "azurerm_application_insights" "web_app_service" {
      ~ app_id                                = "fd011b76-32d8-452f-a02d-107ab33d3e79" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Insights/components/find-a-tp-pr-353-insights" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "find-a-tp-pr-353-insights" -> "find-a-tp-pr-353-pr-353-insights" # forces replacement
      ~ resource_group_name                   = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
        tags                                  = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      ~ workspace_id                          = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-353-webappservice" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_endpoint.endpoint[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      ~ cdn_frontdoor_profile_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn" # forces replacement -> (known after apply) # forces replacement
      ~ host_name                = "find-a-tp-pr-353-cdnendpoint-ege4f6euezb5hgc0.z01.azurefd.net" -> (known after apply)
      ~ id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/afdEndpoints/find-a-tp-pr-353-cdnendpoint" -> (known after apply)
      ~ name                     = "find-a-tp-pr-353-cdnendpoint" -> "find-a-tp-pr-353-pr-353-cdnendpoint" # forces replacement
        tags                     = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_firewall_policy.waf[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      ~ frontend_endpoint_ids             = [] -> (known after apply)
      ~ id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/findatppr353waf" -> (known after apply)
      ~ name                              = "findatppr353waf" -> "findatppr353pr353waf" # forces replacement
      ~ resource_group_name               = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
        tags                              = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (5 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "RateLimiting"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              - transforms         = [] -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin.origin[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_origin" "origin" {
      ~ cdn_frontdoor_origin_group_id  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/originGroups/find-a-tp-pr-353-origingroup" # forces replacement -> (known after apply) # forces replacement
      ~ health_probes_enabled          = true -> (known after apply)
      ~ host_name                      = "find-a-tp-pr-353.azurewebsites.net" -> (known after apply)
      ~ id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/originGroups/find-a-tp-pr-353-origingroup/origins/find-a-tp-pr-353origin" -> (known after apply)
      ~ name                           = "find-a-tp-pr-353origin" -> "find-a-tp-pr-353-pr-353origin" # forces replacement
      ~ origin_host_header             = "find-a-tp-pr-353.azurewebsites.net" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin_group.group[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_origin_group" "group" {
      ~ cdn_frontdoor_profile_id                                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn" # forces replacement -> (known after apply) # forces replacement
      ~ id                                                        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/originGroups/find-a-tp-pr-353-origingroup" -> (known after apply)
      ~ name                                                      = "find-a-tp-pr-353-origingroup" -> "find-a-tp-pr-353-pr-353-origingroup" # forces replacement
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_profile.cdn[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_profile" "cdn" {
      ~ id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn" -> (known after apply)
      ~ name                     = "find-a-tp-pr-353-cdn" -> "find-a-tp-pr-353-pr-353-cdn" # forces replacement
      ~ resource_group_name      = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ resource_guid            = "fc1ea5a8-5bca-47bf-9f64-bc540814b619" -> (known after apply)
        tags                     = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (2 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_route.route[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_route" "route" {
      - cdn_frontdoor_custom_domain_ids = [] -> null
      ~ cdn_frontdoor_endpoint_id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/afdEndpoints/find-a-tp-pr-353-cdnendpoint" # forces replacement -> (known after apply) # forces replacement
      ~ cdn_frontdoor_origin_group_id   = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/originGroups/find-a-tp-pr-353-origingroup" -> (known after apply)
      ~ cdn_frontdoor_origin_ids        = [
          - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/originGroups/find-a-tp-pr-353-origingroup/origins/find-a-tp-pr-353origin",
        ] -> (known after apply)
      - cdn_frontdoor_rule_set_ids      = [] -> null
      ~ id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/afdEndpoints/find-a-tp-pr-353-cdnendpoint/routes/find-a-tp-pr-353route" -> (known after apply)
      ~ name                            = "find-a-tp-pr-353route" -> "find-a-tp-pr-353-pr-353route" # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_security_policy.waf[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "waf" {
      ~ cdn_frontdoor_profile_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/securityPolicies/findatppr353wafsecuritypolicy" -> (known after apply)
      ~ name                     = "findatppr353wafsecuritypolicy" -> "findatppr353pr353wafsecuritypolicy" # forces replacement

      ~ security_policies {
          ~ firewall {
              ~ cdn_frontdoor_firewall_policy_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/findatppr353waf" # forces replacement -> (known after apply) # forces replacement

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Cdn/profiles/find-a-tp-pr-353-cdn/afdEndpoints/find-a-tp-pr-353-cdnendpoint" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault.default will be created
  + resource "azurerm_key_vault" "default" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Create",
                  + "Get",
                ]
              + object_id          = "049a4264-d53c-47da-ba4b-d8f2dc8ff057"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                ]
              + object_id          = (known after apply)
              + secret_permissions = [
                  + "Get",
                  + "List",
                ]
              + tenant_id          = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "findatppr353pr353-kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "s177d01-ntp-pr-353-pr-353"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + tenant_id                     = "9c7d9dd3-840c-4b3f-818e-552865082e16"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "BlobStorage--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpredisconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpredisconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ConnectionStrings--FatpRedis"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.govuknotifyapikey will be created
  + resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "GovUkNotify--ApiKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] must be replaced
-/+ resource "azurerm_linux_web_app" "default" {
      ~ app_settings                      = {
          - "APPINSIGHTS_INSTRUMENTATIONKEY"                  = (sensitive value)
          - "APPINSIGHTS_PROFILERFEATURE_VERSION"             = "1.0.0"
          - "APPINSIGHTS_SNAPSHOTFEATURE_VERSION"             = "1.0.0"
          - "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
          - "ASPNETCORE_ENVIRONMENT"                          = "Development"
          - "ApplicationInsightsAgent_EXTENSION_VERSION"      = "~2"
          - "BlobStorage_AccountName"                         = "s177p01sharedtpdata"
          - "BlobStorage_ClientId"                            = "fdd09510-77b0-419f-b67c-2b5a25a073f0"
          - "BlobStorage_ContainerName"                       = "ntp-tp-data"
          - "BlobStorage_TenantId"                            = "9c7d9dd3-840c-4b3f-818e-552865082e16"
          - "DiagnosticServices_EXTENSION_VERSION"            = "~3"
          - "EmailSettings_AllSentToEnquirer"                 = "true"
          - "EmailSettings_AmalgamateResponses"               = "true"
          - "FatpAzureKeyVaultName"                           = "find-a-tp-pr-353-kv"
          - "InstrumentationEngine_EXTENSION_VERSION"         = "disabled"
          - "SnapshotDebugger_EXTENSION_VERSION"              = "disabled"
          - "XDT_MicrosoftApplicationInsights_BaseExtensions" = "disabled"
          - "XDT_MicrosoftApplicationInsights_Java"           = "1"
          - "XDT_MicrosoftApplicationInsights_Mode"           = "recommended"
          - "XDT_MicrosoftApplicationInsights_NodeJS"         = "1"
          - "XDT_MicrosoftApplicationInsights_PreemptSdk"     = "disabled"
        } -> (known after apply)
      ~ custom_domain_verification_id     = (sensitive value)
      ~ default_hostname                  = "find-a-tp-pr-353.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/sites/find-a-tp-pr-353" -> (known after apply)
      ~ key_vault_reference_identity_id   = "SystemAssigned" -> (known after apply)
      ~ kind                              = "app,linux" -> (known after apply)
      ~ name                              = "find-a-tp-pr-353" -> "find-a-tp-pr-353-pr-353" # forces replacement
      ~ outbound_ip_address_list          = [
          - "20.4.184.203",
          - "20.4.184.204",
          - "20.4.184.207",
          - "20.103.51.101",
          - "20.4.184.210",
          - "20.4.184.213",
          - "20.103.53.245",
          - "20.103.54.26",
          - "20.103.54.49",
          - "20.103.54.62",
          - "20.103.54.105",
          - "20.4.184.62",
          - "20.105.232.44",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "20.4.184.203,20.4.184.204,20.4.184.207,20.103.51.101,20.4.184.210,20.4.184.213,20.103.53.245,20.103.54.26,20.103.54.49,20.103.54.62,20.103.54.105,20.4.184.62,20.105.232.44" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "20.4.184.203",
          - "20.4.184.204",
          - "20.4.184.207",
          - "20.103.51.101",
          - "20.4.184.210",
          - "20.4.184.213",
          - "20.103.53.245",
          - "20.103.54.26",
          - "20.103.54.49",
          - "20.103.54.62",
          - "20.103.54.105",
          - "20.4.184.62",
          - "20.76.221.28",
          - "20.4.184.66",
          - "20.4.184.68",
          - "20.4.184.131",
          - "20.4.184.133",
          - "20.76.219.105",
          - "20.76.220.4",
          - "20.4.184.141",
          - "20.4.184.142",
          - "20.4.184.176",
          - "20.4.184.185",
          - "20.4.184.187",
          - "20.4.184.203",
          - "20.4.184.204",
          - "20.4.184.207",
          - "20.103.51.101",
          - "20.4.184.210",
          - "20.4.184.213",
          - "20.4.185.8",
          - "20.4.185.10",
          - "20.4.185.32",
          - "20.4.185.48",
          - "20.4.185.106",
          - "20.4.185.119",
          - "20.105.232.44",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "20.4.184.203,20.4.184.204,20.4.184.207,20.103.51.101,20.4.184.210,20.4.184.213,20.103.53.245,20.103.54.26,20.103.54.49,20.103.54.62,20.103.54.105,20.4.184.62,20.76.221.28,20.4.184.66,20.4.184.68,20.4.184.131,20.4.184.133,20.76.219.105,20.76.220.4,20.4.184.141,20.4.184.142,20.4.184.176,20.4.184.185,20.4.184.187,20.4.184.203,20.4.184.204,20.4.184.207,20.103.51.101,20.4.184.210,20.4.184.213,20.4.185.8,20.4.185.10,20.4.185.32,20.4.185.48,20.4.185.106,20.4.185.119,20.105.232.44" -> (known after apply)
      ~ resource_group_name               = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ service_plan_id                   = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/serverfarms/find-a-tp-pr-353" -> (known after apply)
      ~ site_credential                   = [
          - {
              - name     = "$find-a-tp-pr-353"
              - password = "p65JLglHgQ58tqgCcsfB1ilywgpE5SdYWsEmgWvpizamKgpSYqacSFMB58SY"
            },
        ] -> (known after apply)
        tags                              = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      ~ virtual_network_subnet_id         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" -> (known after apply)
      + zip_deploy_file                   = (known after apply)
        # (6 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "33a83012-e004-4513-bfca-a78afc5ecd9a" -> (known after apply)
          ~ tenant_id    = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = true -> (known after apply)
          ~ ip_restriction                          = [
              ~ {
                  ~ headers                   = [
                      ~ {
                          ~ x_azure_fdid      = [
                              - "fc1ea5a8-5bca-47bf-9f64-bc540814b619",
                            ] -> (known after apply)
                          - x_fd_health_probe = []
                          - x_forwarded_for   = []
                          - x_forwarded_host  = []
                        },
                    ]
                  - ip_address                = ""
                    name                      = "Allow CDN Traffic"
                  - virtual_network_subnet_id = ""
                    # (3 unchanged attributes hidden)
                },
            ]
          ~ linux_fx_version                        = "DOTNETCORE|6.0" -> (known after apply)
          ~ remote_debugging_version                = "VS2019" -> (known after apply)
          ~ scm_ip_restriction                      = [] -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
            # (17 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_log_analytics_workspace.web_app_service must be replaced
-/+ resource "azurerm_log_analytics_workspace" "web_app_service" {
      - cmk_for_query_forced               = false -> null
      ~ id                                 = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-353-webappservice" -> (known after apply)
      ~ name                               = "find-a-tp-pr-353-webappservice" -> "find-a-tp-pr-353-pr-353-webappservice" # forces replacement
      ~ primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      ~ resource_group_name                = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ secondary_shared_key               = (sensitive value)
        tags                               = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      ~ workspace_id                       = "22d03b60-b6bb-446b-a469-deab19a0ff5f" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.container_app[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "container_app" {
      ~ id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs|find-a-tp-pr-353-storage-diag" -> (known after apply)
      + log_analytics_destination_type = "Dedicated"
      ~ log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-353-webappservice" -> (known after apply)
      ~ name                           = "find-a-tp-pr-353-storage-diag" -> "find-a-tp-pr-353-pr-353-storage-diag" # forces replacement
      ~ target_resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs" # forces replacement -> (known after apply) # forces replacement

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app_service must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "web_app_service" {
      ~ id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/sites/find-a-tp-pr-353|find-a-tp-pr-353-webappservice" -> (known after apply)
      + log_analytics_destination_type = (known after apply)
      ~ log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-353-webappservice" -> (known after apply)
      ~ name                           = "find-a-tp-pr-353-webappservice" -> "find-a-tp-pr-353-pr-353-webappservice" # forces replacement
      ~ target_resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/sites/find-a-tp-pr-353" # forces replacement -> (known after apply) # forces replacement

      - log {
          - category = "AppServiceAppLogs" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 30 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AppServiceAuditLogs" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 30 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AppServiceConsoleLogs" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 30 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AppServiceHTTPLogs" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 30 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AppServiceIPSecAuditLogs" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 30 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AppServicePlatformLogs" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 30 -> null
              - enabled = true -> null
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_nat_gateway.default[0] must be replaced
-/+ resource "azurerm_nat_gateway" "default" {
      ~ id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/natGateways/find-a-tp-pr-353-default" -> (known after apply)
      ~ name                    = "find-a-tp-pr-353-default" -> "find-a-tp-pr-353-pr-353-default" # forces replacement
      ~ resource_group_name     = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ resource_guid           = "cde30216-c41c-4287-b378-dbfb2a094f4b" -> (known after apply)
        tags                    = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      - zones                   = [] -> null
        # (3 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_nat_gateway_public_ip_association.default[0] must be replaced
-/+ resource "azurerm_nat_gateway_public_ip_association" "default" {
      ~ id                   = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/natGateways/find-a-tp-pr-353-default|/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/publicIPAddresses/find-a-tp-pr-353-natgateway" -> (known after apply)
      ~ nat_gateway_id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/natGateways/find-a-tp-pr-353-default" # forces replacement -> (known after apply) # forces replacement
      ~ public_ip_address_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/publicIPAddresses/find-a-tp-pr-353-natgateway" # forces replacement -> (known after apply) # forces replacement
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_network_security_group.web_app_service_infra_allow_frontdoor_inbound_only[0] must be replaced
-/+ resource "azurerm_network_security_group" "web_app_service_infra_allow_frontdoor_inbound_only" {
      ~ id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/networkSecurityGroups/find-a-tp-pr-353-webappserviceinfransg" -> (known after apply)
      ~ name                = "find-a-tp-pr-353-webappserviceinfransg" -> "find-a-tp-pr-353-pr-353-webappserviceinfransg" # forces replacement
      ~ resource_group_name = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "20.105.232.44/32"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowFrontdoor"
              - priority                                   = 100
              - protocol                                   = "*"
              - source_address_prefix                      = "AzureFrontDoor.Backend"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = (known after apply)
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowFrontdoor"
              + priority                                   = 100
              + protocol                                   = "*"
              + source_address_prefix                      = "AzureFrontDoor.Backend"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server.default will be created
  + resource "azurerm_postgresql_flexible_server" "default" {
      + administrator_login           = "fatpadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "findatppr353pr353-psqlflexible-server"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-353-pr-353"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + tags                          = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + version                       = "14"
      + zone                          = "1"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_configuration.extensions[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "CITEXT,UUID-OSSP"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_database.default will be created
  + resource "azurerm_postgresql_flexible_server_database" "default" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "find-a-tp-pr-353-pr-353-db"
      + server_id = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_firewall_rule.web_app_default_static_ip[0] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "web_app_default_static_ip" {
      + end_ip_address   = (known after apply)
      + id               = (known after apply)
      + name             = "findatppr353pr353webapp"
      + server_id        = (known after apply)
      + start_ip_address = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_public_ip.nat_gateway[0] must be replaced
-/+ resource "azurerm_public_ip" "nat_gateway" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/publicIPAddresses/find-a-tp-pr-353-natgateway" -> (known after apply)
      ~ ip_address              = "13.80.73.157" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "find-a-tp-pr-353-natgateway" -> "find-a-tp-pr-353-pr-353-natgateway" # forces replacement
      ~ resource_group_name     = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
        tags                    = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      - zones                   = [] -> null
        # (7 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_redis_cache.default will be created
  + resource "azurerm_redis_cache" "default" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = "findatppr353pr353-redis-cache"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-353-pr-353"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "Environment"      = "pr-353"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_redis_firewall_rule.web_app_default_static_ip will be created
  + resource "azurerm_redis_firewall_rule" "web_app_default_static_ip" {
      + end_ip              = (known after apply)
      + id                  = (known after apply)
      + name                = "findatppr353pr353webapp"
      + redis_cache_name    = "findatppr353pr353-redis-cache"
      + resource_group_name = "s177d01-ntp-pr-353-pr-353"
      + start_ip            = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] must be replaced
-/+ resource "azurerm_resource_group" "default" {
      ~ id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353" -> (known after apply)
      ~ name     = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_route_table.default[0] must be replaced
-/+ resource "azurerm_route_table" "default" {
      ~ id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/routeTables/find-a-tp-pr-353-default" -> (known after apply)
      ~ name                          = "find-a-tp-pr-353-default" -> "find-a-tp-pr-353-pr-353-default" # forces replacement
      ~ resource_group_name           = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ route                         = [] -> (known after apply)
      ~ subnets                       = [
          - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra",
        ] -> (known after apply)
        tags                          = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (2 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_service_plan.default must be replaced
-/+ resource "azurerm_service_plan" "default" {
      ~ id                           = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/serverfarms/find-a-tp-pr-353" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "find-a-tp-pr-353" -> "find-a-tp-pr-353-pr-353" # forces replacement
      ~ reserved                     = true -> (known after apply)
      ~ resource_group_name          = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
        tags                         = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      ~ worker_count                 = 1 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] must be replaced
-/+ resource "azurerm_storage_account" "logs" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
      ~ name                              = "findatppr353logs" -> "findatppr353pr353logs" # forces replacement
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://findatppr353logs.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "findatppr353logs.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://findatppr353logs.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "findatppr353logs.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://findatppr353logs.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "findatppr353logs.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "westeurope" -> (known after apply)
      ~ primary_queue_endpoint            = "https://findatppr353logs.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "findatppr353logs.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://findatppr353logs.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "findatppr353logs.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://findatppr353logs.z6.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "findatppr353logs.z6.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
        tags                              = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (17 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [
              - "40.122.243.248",
              - "52.190.17.206",
            ] -> null
          - virtual_network_subnet_ids = [
              - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra",
            ] -> null

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/sites/find-a-tp-pr-353" -> null
              - endpoint_tenant_id   = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> null
            }
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] must be replaced
-/+ resource "azurerm_storage_account_network_rules" "logs" {
      ~ id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs" -> (known after apply)
      ~ ip_rules                   = [
          - "40.122.243.248",
          - "52.190.17.206",
        ] -> (known after apply)
      ~ storage_account_id         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs" # forces replacement -> (known after apply) # forces replacement
      ~ virtual_network_subnet_ids = [
          - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ private_link_access {
          ~ endpoint_resource_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Web/sites/find-a-tp-pr-353" -> (known after apply)
          ~ endpoint_tenant_id   = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_container.logs["app"] must be replaced
-/+ resource "azurerm_storage_container" "logs" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://findatppr353logs.blob.core.windows.net/find-a-tp-pr-353applogs" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
      ~ name                    = "find-a-tp-pr-353applogs" -> "find-a-tp-pr-353-pr-353applogs" # forces replacement
      ~ resource_manager_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs/blobServices/default/containers/find-a-tp-pr-353applogs" -> (known after apply)
      ~ storage_account_name    = "findatppr353logs" -> "findatppr353pr353logs" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_container.logs["http"] must be replaced
-/+ resource "azurerm_storage_container" "logs" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://findatppr353logs.blob.core.windows.net/find-a-tp-pr-353httplogs" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
      ~ name                    = "find-a-tp-pr-353httplogs" -> "find-a-tp-pr-353-pr-353httplogs" # forces replacement
      ~ resource_manager_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Storage/storageAccounts/findatppr353logs/blobServices/default/containers/find-a-tp-pr-353httplogs" -> (known after apply)
      ~ storage_account_name    = "findatppr353logs" -> "findatppr353pr353logs" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.web_app_service_infra_subnet[0] must be replaced
-/+ resource "azurerm_subnet" "web_app_service_infra_subnet" {
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" -> (known after apply)
      ~ name                                           = "find-a-tp-pr-353-webappserviceinfra" -> "find-a-tp-pr-353-pr-353-webappserviceinfra" # forces replacement
      ~ private_endpoint_network_policies_enabled      = true -> (known after apply)
      ~ private_link_service_network_policies_enabled  = true -> (known after apply)
      ~ resource_group_name                            = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      - service_endpoint_policy_ids                    = [] -> null
      ~ virtual_network_name                           = "find-a-tp-pr-353-default" -> "find-a-tp-pr-353-pr-353-default" # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_nat_gateway_association.app_service[0] must be replaced
-/+ resource "azurerm_subnet_nat_gateway_association" "app_service" {
      ~ id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" -> (known after apply)
      ~ nat_gateway_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/natGateways/find-a-tp-pr-353-default" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" # forces replacement -> (known after apply) # forces replacement
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_network_security_group_association.web_app_service_infra_allow_frontdoor_inbound_only[0] must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "web_app_service_infra_allow_frontdoor_inbound_only" {
      ~ id                        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/networkSecurityGroups/find-a-tp-pr-353-webappserviceinfransg" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                 = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" # forces replacement -> (known after apply) # forces replacement
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_route_table_association.web_app_service_infra_subnet[0] must be replaced
-/+ resource "azurerm_subnet_route_table_association" "web_app_service_infra_subnet" {
      ~ id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" -> (known after apply)
      ~ route_table_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/routeTables/find-a-tp-pr-353-default" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra" # forces replacement -> (known after apply) # forces replacement
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] must be replaced
-/+ resource "azurerm_virtual_network" "default" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "cd8d7339-fa74-4bde-b2f8-d26d2495f9f3" -> (known after apply)
      ~ id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default" -> (known after apply)
      ~ name                    = "find-a-tp-pr-353-default" -> "find-a-tp-pr-353-pr-353-default" # forces replacement
      ~ resource_group_name     = "s177d01-ntp-pr-353" -> "s177d01-ntp-pr-353-pr-353" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefix = "172.0.0.0/23"
              - id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-353-default/subnets/find-a-tp-pr-353-webappserviceinfra"
              - name           = "find-a-tp-pr-353-webappserviceinfra"
              - security_group = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-353/providers/Microsoft.Network/networkSecurityGroups/find-a-tp-pr-353-webappserviceinfransg"
            },
        ] -> (known after apply)
        tags                    = {
            "Environment"      = "pr-353"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 39 to add, 0 to change, 38 to destroy.

Changes to Outputs:
  - azurerm_cdn_frontdoor_endpoint_host_name = "find-a-tp-pr-353-cdnendpoint-ege4f6euezb5hgc0.z01.azurefd.net" -> null
  - azurerm_linux_web_app_name               = "find-a-tp-pr-353" -> null
  - azurerm_resource_group_name              = "s177d01-ntp-pr-353" -> null
```
</details>